{"config": [{"config": {"bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "bias_regularizer": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 32, "trainable": true, "batch_input_shape": [null, 32, 32, 3], "activity_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_1", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "units": 512, "activation": "linear", "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_2", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "units": 10, "activation": "linear", "name": "dense_2", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_3", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.0.9", "class_name": "Sequential"}