{"class_name": "Sequential", "keras_version": "2.0.9", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_constraint": null, "batch_input_shape": [null, 32, 32, 3], "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "valid", "name": "conv2d_1", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "filters": 32, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "filters": 32, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "rate": 0.25, "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "filters": 64, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "valid", "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "filters": 64, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "rate": 0.25, "seed": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "units": 512, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "use_bias": true, "trainable": true, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_3", "rate": 0.5, "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "units": 10, "bias_constraint": null, "activity_regularizer": null, "name": "dense_2", "kernel_constraint": null, "use_bias": true, "trainable": true, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "softmax"}}]}